{
  "content": "\r\nTwo advocates discussed personal lives, show topics, and the importance of healthy divorces and parenting tools. They emphasized the need for guidance in parenting, maintaining positive post-divorce relationships, and managing conversations with children on sensitive topics. They also highlighted the impact of perspectives on children, the role of attorneys in divorce, and resources to support families in transition.\r\n\r\nNext Steps:\r\n\r\nOne host to schedule the other as a guest on their podcast about healthy divorce.\r\nThe guest to share the episode on their social media.\r\nHost to provide the guest with promotional materials for their services.\r\nGuest to include the host’s consultation offer in podcast notes.\r\nBoth to plan further collaborative content on divorce and co-parenting.\r\nHost to send the booking link for the recording session.\r\nGuest to prepare questions for their appearance on the podcast.\r\nCasual Conversation and Conference Breaks: The two had a light conversation about their personal lives, seasons, and conference breaks. One had just finished a long Black Friday marketing conference with male speakers and was glad for a break.\r\n\r\nPlanning Show on Healthy Divorces: They discussed the upcoming show on good divorces and parenting tools, covering topics like telling children about divorce, transitions, and co-parenting misconceptions. Personal matters included one recovering from bronchitis and the other’s humorous story of over-ordering throat coat tea.\r\n\r\nAdvocating a Healthy Divorce Mindset: They highlighted the importance of positivity in divorce, with a reminder that it’s adults' behavior, not divorce itself, that can harm children. They recommended professionals like co-parenting specialists to help ensure a healthy family post-divorce.\r\n\r\nMaintaining Positive Post-Divorce Relationships: They stressed the importance of a supportive relationship with the other parent post-divorce for the children’s well-being, avoiding negative talk about each other, and creating safe boundaries for children.\r\n\r\nNavigating Divorce With Emotional Support: One shared how their own divorce experience led to creating support resources. They discussed planning conversations with children carefully, acknowledging their emotions, and avoiding feelings of abandonment.\r\n\r\nTiming and Content in Sensitive Conversations: They emphasized timing when discussing sensitive topics with children, encouraging pauses to allow children to process information, and not overloading details.\r\n\r\nProtecting Children From Parental Conflict: One shared a personal story of managing frustrations in front of children. They stressed the importance of letting children express discomfort and avoiding forming opinions about a parent based on another’s views.\r\n\r\nImpact of Perspectives in Family Dynamics: The two discussed the evolving family dynamics with stepchildren and the importance of an “abundance mindset” rather than one of scarcity in blended families.\r\n\r\nHealthy Relationships and Divorce Process: They emphasized maintaining healthy relationships for children’s sake, recognizing when to end a relationship amicably, and choosing attorneys who prioritize family well-being.\r\n\r\nPositivity in Divorce and Available Resources: They encouraged a positive outlook during divorce and promoted resources for support, with one host offering guidance as a divorce coach and emphasizing the potential benefits of a healthy divorce for families.\r\n"
}