{
  "content": "\r\n\"2023 Crush Your Goals Masterclass\" by Celia Kibler:\r\n\r\nFour M's of Goal Setting:\r\n- Mindset: Believe in your ability to achieve the goal.\r\n- Mission: Define what you are setting out to do.\r\n- Mastery: Gain knowledge and skills needed to accomplish the goal.\r\n- Master Plan: Create a detailed action plan with steps.\r\n\r\nMorning Three: A gratitude exercise to shift mindset toward positivity.\r\n- I am grateful for...\r\n- I am... (positive affirmation).\r\n- Wouldn't it be awesome if...\r\n\r\nBelief in the Goal:\r\nBelieve in yourself, your ability to achieve the goal, and the importance of the goal.\r\n\r\nSet Realistic and Achievable Goals:\r\n- Break down big goals into small, actionable steps.\r\n- Create a timeline to ensure progress is achievable and trackable.\r\n\r\nConsistency and Persistence:\r\n- Stay consistent and committed to your goals.\r\n- Avoid giving up when challenges arise.\r\n\r\nTake Action:\r\n- Start small and build up; every step counts.\r\n- \"Eat That Frog\": Tackle the most difficult tasks first.\r\n\r\nCelebrate Wins:\r\n-Reward yourself for progress, even small victories.\r\n\r\nMastery:\r\n- Learn from failures and mistakes, as they are opportunities for growth.\r\n- Seek education, services, and tools needed for success (e.g., financial education when moving to a new home).\r\n\r\nMission Categories:\r\n- Set goals in various life areas: physical, spiritual, personal, professional, and charitable.\r\n\r\nCreate and Stick to Routines:\r\n- Establish routines that support goal achievement, e.g., daily exercise or financial savings.\r\n\r\nAccountability:\r\n- Use tools like alarms, sticky notes, and vision boards to stay on track.\r\n- Share your goals with someone to keep yourself accountable.\r\n\r\nFocus on Personal Goals:\r\n- Avoid societal pressure; focus on what success means to you personally, not what others think it should be.\r\n\r\nOvercome Challenges:\r\n- Challenges are part of the journey toward mastering your goals.\r\n- Persistence through discomfort leads to success.\r\n\r\nBreak Tasks into Smaller Steps:\r\n-For any major goal, break it down into smaller, more manageable tasks and focus on one thing at a time.\r\n\r\nUtilize Tools and Resources:\r\n- For specific tasks like moving, research and use experts, e.g., real estate professionals, movers, financial advisors.\r\n\r\nGive Yourself Time to Relax and Recharge:\r\n- Incorporate breaks into your routine to avoid burnout.\r\n\r\nInspiration and Motivation:\r\n- Quotes like \"You do not decide your future, you decide your habits\" serve as powerful reminders to stick to healthy habits that build toward your goal.\r\n"
}